10. Модели в науках о жизни 10.1. Модели в биологии Биология связана с химией и биохимией: структурное моделирование из химии перешло и в биологию. «Все биологические системы являются сложными многокомпонентными, пространственно структурированными, элементы которых обладают индивидуальностью. При моделировании таких систем возможно два подхода. Первый – агрегированный, феноменологический. В соответствии с этим подходом выделяются определяющие характеристики системы (например, общая численность видов) и рассматриваются качественные свойства поведения этих величин во времени (устойчивость стационарного состояния, наличие колебаний, существование пространственной неоднородности). Такой подход является исторически наиболее древним, он свойственен динамической теории популяций... Другой подход - подробное рассмотрение элементов системы и их взаимодействий, рассмотренное выше имитационное моделирование…, [которое] при хорошей экспериментальной изученности фрагментов системы может дать количественный прогноз ее поведения при различных внешних воздействиях… Особенно привлекательным оказалось применение имитационных моделей для описания экологических систем – чрезвычайно сложных образований, включающих множество биологических, геологических, метеорологических и прочих факторов» [Г. Ризниченко, 149]. «Первые попытки математически описать биологические процессы относятся к моделям популяционной динамики. Эта область матема-тической биологии и в дальнейшем служила математическим полигоном, на котором "отрабатывались" математические модели в разных областях биологии. В том числе модели эволюции, микробиологии, иммунологии и других областей, связанных с клеточными популяциями» [149]. Модели в биологии приведены в таблице 32. См. также разделы 7.4, 10, 11. Самая первая известная модель, сформулированная в биологической постановке, – знаменитый ряд Фибоначчи. Это ряд чисел, описывающий количество пар кроликов, которые рождаются каждый месяц, если кролики начинают размножаться со второго месяца, и каждый месяц дают потомство в виде пары кроликов. Ряд представляет последовательность чисел: 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, …, каждое из которых равно сумме двух предыдущих. Среди первых были модели внутривидовой борьбы, межвидовой конкуренции, модель «жизнь», эпидемий. В моделях эпидемий имитируется размножение простейших существ, задаются некоторые ограничения на размножение, гибель и т.д., а затем запускается эксперимент и прослеживается динамика со временем. Математические модели популяционной генетики бывают детерминистическими и стохастическими (вероятностными). Детерминистические модели предполагают, что численность популяции бесконечно велика. В этом случае флуктуациями в распределении частот генов можно пренебречь, и динамику популяции можно описать в терминах средних частот генов. Вероятностные модели включают анализ с помощью цепей Маркова и диффузионные методы. Частными случаями этих моделей являются модели обмена генами между субпопуляциями: островная, изоляции расстоянием, ступенчатая, «шахматная», иерархическая. В биохимии, изучающей химию биологических структур, используются структурные модели. Наиболее известные среди них модели генов и ДНК. В биологии архетип – например, представление о первичном типе, прототипе, но фактически, модели строения скелета всех позвоночных животных.

Таблица 32. Модели в биологии, генетике, экологии и медицине

    32.1. Биометрические
        32.1.1. Экспериментальные
    32.1. Биометрические
        32.1.2. Другие
    32.2. Феноменологические
    32.3. Имитационные
        32.3.1. Внутривидовой борьбы
    32.3. Имитационные
        32.3.2. Межвидовой конкуренции
    32.3. Имитационные
        32.3.3. «Жизнь»
    32.3. Имитационные
        32.3.4. Эпидемий
            32.3.4.1. Детерминистические (SIR, SEIR и др.)
    32.3. Имитационные
        32.3.4. Эпидемий
            32.3.4.2. Популяционные
    32.3. Имитационные
        32.3.4. Эпидемий
            32.3.4.3. Аналитические
    32.3. Имитационные
        32.3.4. Эпидемий
            32.3.4.4. Численные
    32.3. Имитационные
        32.3.4. Эпидемий
            32.3.4.5. Стохастические
    32.3. Имитационные
        32.3.4. Эпидемий
            32.3.4.6. Многокомпонентные
    32.3. Имитационные
        32.3.4. Эпидемий
            32.3.4.7. Другие
    32.3. Имитационные
        32.3.5. Популяци-онной генетики
            32.3.5.1. Детерминистические
    32.3. Имитационные
        32.3.5. Популяци-онной генетики
            32.3.5.2. Стохастические
    32.3. Имитационные
        32.3.5. Популяци-онной генетики
            32.3.5.3. Обмена генами (изоляционные, островные, ступенчатые и др.)
    32.3. Имитационные
        32.3.5. Популяци-онной генетики
            32.3.5.4. Системная
    32.3. Имитационные
        32.3.5. Популяци-онной генетики
            32.3.5.5. Диатропическая
    32.3. Имитационные
        32.3.5. Популяци-онной генетики
            32.3.5.6. Другие
    32.3. Имитационные
        32.3.6. Динамики возрастных групп
    32.3. Имитационные
        32.7.7. Гомологических рядов
    32.3. Имитационные
        32.3.8. Другие
    32.4. Фрактальные
    32.5. Структурные
    32.5.1 Генов и ДНК
    32.5. Структурные
        32.5.2. Архетиповые
    32.5. Структурные
        32.5.3. Другие
    32.6. Эволюционные
    32.7. Вербальные
        32.7.1. Гомеопатии
    32.7. Вербальные
        32.7.2. Народной медицины
    32.7. Вербальные
        32.7.3. Другие
    32.7. Баланса вещества и энергии
    32.8. Мишений
    32.9. Материальные
        32.9.1. Медицинские протезы
    32.9. Материальные
        32.9.2. Биологических мембран
    32.9. Материальные
        32.9.3. Животные
    32.9. Материальные
        32.9.4. Вирусы
    32.9. Материальные
        32.9.5. Люди
    32.9. Материальные
        32.9.6. Другие
    32.10. Другие

В биологии используются модели биологические, физико-химические и математические. Модель гомологических рядов наследственной изменчивости Н.И. Вавилова позволяет с определёнными ограничениями переносить экспериментальные данные на человека. Вирусы культивируют на трех материальных биологических моделях: в организме лабораторных животных, в развивающихся эмбрионах птиц (чаще на куриных эмбрионах) и культурах клеток (тканей). Аквариум является примером физического моделирования водной экосистемы. На подобных выделенных системах часто изучают процессы, происходящие в живой природе. Некоторые растворы неорганических и органических веществ позволяют имитировать внутреннюю среду организма и поддерживать существование изолированных органов или культивируемых вне организма клеток. Модели биологических мембран (плёнка из природных фосфолипидов разделяет раствор электролита) позволяют исследовать физико-химические основы процессов транспорта ионов и влияние на него различных факторов Модельным объектом в генетике обычно считают организмы, удовлетворяющие большинству требований экспериментатора при решении определенной генетической задачи, прежде всего обеспечивающие большую разрешающую способность анализа, например, кукуруза, дрожжи, хлебная плесень. Родоначальник генетики И.-Г. Мендель посвятил этому вопросу специальный раздел в работе "Опыты над растительными гибридами", так и назвав его: "Выбор подопытных растений". Кукуруза - один из основных объектов фундаментальных исследований в области генетики и селекции растений. Исследование популяция мушки-дрозофилы является классическим объектом моделирования микроэволюционного процесса и примером исключительно удачно найденной модели. Еще более удобной моделью являются вирусы, хотя не вполне ясно, справедливы ли эволюционные закономерности, установленные на вирусах, для законов эволюции высших животных [Г. Ризниченко, 148]. Согласно модели мишений, каждая клетка, организм или ген представляют собой “мишень”, а происходящие с ними изменения – результат случайных ударов (попаданий) при бомбардировке этих мишеней. Такие модели применяют для объяснения и оценки эффективности воздействия ионизирующего излучения и других факторов на живые организмы, в частности, связанных с процессами старения. 10.2. Модели биологической эволюции Наиболее известные модели биологической эволюции представлены в таблице 33.

Таблица 33. Модели биологической эволюции

    33.1. Креационистские
        33.1.1. Аристотеля
    33.1. Креационистские
        33.1.2. Монотеистических религий
    33.1. Креационистские
        33.1.3. «Научного креационизма»
    33.1. Креационистские
        33.1.4. Другие
    33.2. Наследования приобретенных признаков
    33.3. Изменения под воздействием среды
    33.4. Естественного отбора
        33.4.1. Примитивные
    33.4. Естественного отбора
        33.4.2. Аль-Джахиза
    33.4. Естественного отбора
        33.4.3. Другие
    33.5. Номогенеза
    33.6. Синтетическая
    33.7. Мутационные
        33.7.1. Мутационная Г. де Фриза
    33.7. Мутационные
        33.7.2. Мутационная нейтральности
    33.7. Мутационные
        33.7.3. Блочно-иерархического отбора
    33.7. Мутационные
        33.7.4. Блочно-модульная
    33.7. Мутационные
        33.7.5. Генно-мутаторная
    33.7. Мутационные
        33.7.6. Другие
    33.8. Фрактальная
    33.9. Теистические
    33.10. Прочие

Анаксимандр (родился в 610 г. до н.э.) и Эмпедокл (495 до н.э. - 435 до н.э.) предложили, возможно, первые примитивные модели эволюции. Но более авторитетный Аристотель (384 – 322 гг. до н.э.) был сторонником модели креационизма. Он считал, что эволюции животных и растении вообще не существовало. Арабский ученый Аль-Джахиз (776 – ?) опубликовал модель естественного отбора, напоминающую дарвиновскую, в которой основную роль играл Бог. Известный российский ученый-эволюционист и историк науки Ю.А. Чайковский (1940 г.р.) выделяет четыре основных направления эволюционной мысли (модели) в биологии [165]. 1) Модель наследования приобретенных признаков или ламаркизм (1801 г.). 2) Модель изменений под прямым воздействием среды или жоффруизм (1 пол. 19 в.). 3) Модель естественного отбора случайных отклонений или дарвинизм (1859 г.). 4) Модель развития на основе закономерностей - номогенез Л.С. Берга (1922 г.) или, в некотором смысле, антидарвинизм. По Л.С. Бергу10.1 эволюция – развёртывание уже существующих зачатков; она управляется жесткими законами и строго направлена; эволюционные изменения всегда внезапны, мутационны, и т.д. В результате объединения классического дарвинизма с классической генетикой сформировалась так наз. синтетическая теория (модель) эволюции - неодарвинизм (вейсманизм, конец 19 в.) [А. Марков, 105]. Одна из первых, мутационная модель Г. де Вриза (1901 г.) утверждает: мутация возникает редко и скачкообразно; образовавшиеся новые формы наследуются и могут быть полезными, вредными или нейтральными. В настоящее время разработано несколько мутационных моделей, но наиболее известна модель нейтральности Кимуры. Фрактальная модель Ю.А. Чайковского предполагает, что основные свойства организмов определяются не их родословными, а тем уровнем, до которого они дошли в эволюции - не так уж важно, каким путём. Механизм эволюции такого типа — изменение правил роста фракталов – автопоэз. Теистические модели эволюции представляют собой гибрид креационизма и дарвинизма. Теистические эволюционисты верят, что Бог создал мир, хотя говорят, что Библия никогда не объясняла, как Бог это сделал. Современные сторонники так наз. «научного» креационизма не верят, что один вид может перерасти в другой. Однако они согласны с тем, что виды часто мутируют, чтобы выжить в окружающей среде. То, что эволюция идет без контроля со стороны сверхъестественных разумных сил, по естественным причинам – это общепринятое в науке положение, отказ от которого сделал бы живую природу в основном непознаваемой. Это не означает, что эволюционная теория не совместима с религией. Все перечисленные эволюционные модели были предложены верующими учеными. 10.3. Модели в медицине «Метод моделирования нашел свое применение и в медицине, а также в науках, которые тесно связаны с ней. Метод моделиpования в медицине – это сpедство, которое позволяет устанавливать все более глубокие и сложные взаимосвязи между теоpией и практикой. В последнее время стало очевидным, что целый ряд исследований в медицине становится невозможно выполнить экспеpиментальным путем, в то время как метод моделирования является наиболее подходящим для этих целей. Применение метода моделирования в медицине является незаменимым в случаях, когда вмешательство в биологические системы имеет такой хаpактеp, когда невозможно установить пpичины изменений, которые появились (например, вследствие вмешательства или по дpугим пpичинам); используется экспериментальная техника низкого уpовня; эксперименты, связанные с экспериментированием на человеке, могут быть отклонены по моpально-этическим сообpажениям» [Сайт, 214]. В настоящее время широко используется компьютерное моделирование, в том числе, в травматологии, стоматологии и пр. Имеются имитационные модели многих систем организма – сердца, желудочно-кишечного тракта, почек, печени, мозга, и других. Модельные эксперименты выполняются на подопытных животных, на волонтерах и пр. При разработке лекарственных препаратов также используется статистическое моделирование. Модели гомеопатии и народной медицины основаны на вербальных моделях (см. в таблице 10), учетывающих многовековой опыт. К ним часто существует негативное отношение со стороны официальной медицины и РПЦ, считающих их лженаукой, т.к. лечение осуществляется в соответствии с принципами, не имеющими доказательной базы. Эти модели действительно не имеют доказательной базы в современном понимании или даже противоречат формальной логике. Их эффективность в отдельных случаях ученые медики объясняют принципом «плацебо», т.е. самовнушением. Однако автору известны случаи излечения грудных младенцев, в том числе, собственной внучки, после того как официальная медицина была бессильна. Такие дети вряд ли подвергались самовнушению. И еще моделями являются протезы отсутствующих или нефункционирующих органов человека: конечностей, сердца, легких, почек, зубов и пр. В качестве экспериментальных моделей в вирусологической практике используются чистые линии лабораторных животных: мыши, крысы, морские свинки и кролики, а также куриные эмбрионы, культуры изолированных клеток. С тех пор, как в 1760 году Д. Бернулли впервые была применена математика для оценки эффективности различных способов прививки против оспы, математические модели эпидемий стали быстро развиваться в нескольких направлениях. Появились модели детерминистические, популяционные, аналитические, численные, стохастические, многоком-понентные и другие. К настоящему времени базовой моделью для описания распространения эпидемий является так называемая детермини-стическая модель эпидемий SIR (от английских слов Susceptible - уязвимый, Infected - зараженный, Recovered - выздоровевший) Кермака и Маккендрика (1920-е годы). Имеется несколько усовершенствованных вариантов этой модели. Наиболее продвинутая в настоящее время модель SEIR, которая в 2020 году модель была доработана Р.Нейером и его сотрудниками в Базельском университете с учетом особенностей эпидемии нового коронавируса COVID-19. Она учитывает все основные параметры эпидемии: долю тяжелых больных и уровень летальности в зависимости от возраста больных; длительность инкубационного периода и заразной фазы болезни; неполную регистрацию зараженных из-за большой распространенности бессимптомного протекания болезни и недостаточного тестирования; возможные сезонные изменения заразности вируса; возможные меры сдерживания и подавления эпидемии; мощности медицинской системы и пр.10.2. 10.4. Модели в психологии и психоанализе. Модели бодрствования, сновидений, памяти и другие В психологии, как нигде, существует огромное число соперничающих школ и моделей (таблица 34), причем в отличие от теорий других областей науки ни одна психологическая теория не может быть до конца объективной в силу особенностей изучаемого предмета. Таблица 34. Модели в психологии и психоанализе

    34.1. Бодрствования (нормального сознания)
        34.1.1. Топическая
    34.1. Бодрствования (нормального сознания)
        34.1.2. Структурная
    34.1. Бодрствования (нормального сознания)
        34.1.3. Объектных отношений
    34.1. Бодрствования (нормального сознания)
        34.1.4. Самости
    34.2. Сомнологические (сновидений)
        34.2.1. Метафизическая
    34.2. Сомнологические (сновидений)
        34.2.2. Естественнонаучные
    34.2. Сомнологические (сновидений)
        34.2.3. Психологические
    34.2. Сомнологические (сновидений)
        34.2.4. Интегративные
    34.2. Сомнологические (сновидений)
        34.2.5. Тренировочная
    34.2. Сомнологические (сновидений)
        34.2.6. Другие
    34.3. Памяти
        34.3.1. Функциональные
            34.3.1.1. Произвольная или естественная
    34.3. Памяти
        34.3.1. Функциональные
            34.3.1.2. Механическая
    34.3. Памяти
        34.3.1. Функциональные
            34.3.1.3. Осмысленная или искусная
    34.3. Памяти
        34.3.1. Функциональные
            34.3.1.4. Другие
    34.3. Памяти
        34.3.2. Когнитивные
            34.3.2.1. Долговременные
    34.3. Памяти
        34.3.2. Когнитивные
            34.3.2.2. Кратковременные или рабочие
    34.3. Памяти
        34.3.2. Когнитивные
            34.3.2.3. Сенсорные
    34.3. Памяти
        34.3.2. Когнитивные
            34.3.2.4. Оперативные
    34.3. Памяти
        34.3.2. Когнитивные
            34.3.2.5. Компонентные
    34.3. Памяти
        34.3.2. Когнитивные
            34.3.2.6. Глубинные (альтернативные)
    34.3. Памяти
        34.3.2. Когнитивные
            34.3.2.5. Другие
    34.3. Памяти
        34.3.3. Образные
            34.3.3.1. Зрительные
    34.3. Памяти
        34.3.3. Образные
            34.3.3.2. Слуховые
    34.3. Памяти
        34.3.3. Образные
            34.3.3.3. Другие
    34.3. Памяти
        34.3.4. Эмоциональные
    34.3. Памяти
        34.3.5. Двигательные
    34.3. Памяти
        34.3.6. Словесно-логические
    34.3. Памяти
        34.3.7. Культурные
    34.3. Памяти
        34.3.8. Исторические и религиозные
            34.3.8.1. Метафорические (восковой дощечки и др.)
    34.3. Памяти
        34.3.8. Исторические и религиозные
            34.3.8.2. Театральные
    34.3. Памяти
        34.3.8. Исторические и религиозные
            34.3.8.3. Информационные или кибернетические
    34.3. Памяти
        34.3.8. Исторические и религиозные
            34.3.8.4. Другие
    34.3. Памяти
        34.3.9. Химические (биохимические)
            34.3.9.1. Белковая
    34.3. Памяти
        34.3.9. Химические (биохимические)
            34.3.9.2. Другие
    34.3. Памяти
        34.3.10. Физиологические
            34.3.10.1. Физические
    34.3. Памяти
        34.3.10. Физиологические
            34.3.10.2. Другие
    34.3. Памяти
        34.3.11. Психологические
            34.3.11.1. Ассоциативные
    34.3. Памяти
        34.3.11. Психологические
            34.3.11.2. Гещтальтные
    34.3. Памяти
        34.3.12. Феноменологические
    34.3. Памяти
        34.3.13. Другие
    34.4. Трансперсональные (измененного сознания и религиозного опыта)
    34.5. Болезней и расстройств
        34.5.1. Биомедицинские или органические
            34.5.1.1. Адаптационные
    34.5. Болезней и расстройств
        34.5.1. Биомедицинские или органические
            34.5.1.2. Другие
    34.5. Болезней и расстройств
        34.5.2. Биосоциальные и биопсихо-социальные
            34.5.2.1. Диатес-стрессовая
    34.5. Болезней и расстройств
        34.5.2. Биосоциальные и биопсихо-социальные
            34.5.2.2. Лейбелинговая
    34.5. Болезней и расстройств
        34.5.3. Клинико-психологические или терапевтические
            34.5.3.1. Психоаналитическая
    34.5. Болезней и расстройств
        34.5.3. Клинико-психологические или терапевтические
            34.5.3.2. Гуманистическая
    34.5. Болезней и расстройств
        34.5.3. Клинико-психологические или терапевтические
            34.5.3.3. Поведенческая
    34.5. Болезней и расстройств
        34.5.3. Клинико-психологические или терапевтические
            34.5.3.4. Когнитивная
    34.5. Болезней и расстройств
        34.5.3. Клинико-психологические или терапевтические
            34.5.3.5. Интерперсональная
    34.5. Болезней и расстройств
        34.5.3. Клинико-психологические или терапевтические
            34.5.3.6. Другие
    34.6. Искусственного интеллекта
        34.6.1. Агентные
    34.6. Искусственного интеллекта
        34.6.2. Символьные
    34.6. Искусственного интеллекта
        34.6.3. Когнитивные
    34.6. Искусственного интеллекта
        34.6.4. Фреймовые
    34.6. Искусственного интеллекта
        34.6.5. Гибридные
    34.6. Искусственного интеллекта
        34.6.6. Ассоциативного мышления
    34.6. Искусственного интеллекта
        34.6.7. Другие

При моделировании психики человека используют материальные бионические, образные, математические, вербальные модели. С их помощью изучаются такие свойства, как восприятие, память, обучаемость, логическое мышление, сновидения и т.д. Работы по моделированию психики ведутся не только в психологии, но и в бионике, кибернетике, вычислительной технике, информатике, синергетике. В современном психоанализе бодрствования выделяют четыре взаимно пересекающиеся теоретические модели: топическую, структурную, объектных отношений и самости. Согласно топической теории (модели) З. Фрейда (1856 – 1939) психика или личность человека имеет сложную структуру, включающую сознание, предсознание и бессознательное. Бессознательные инстинкты, в первую очередь сексуальные влечения (либидо), являются основными побудительными силами поведения личности. Согласно структурной модели З.Фрейда психика разделялась на Я, Сверх-Я и Оно. Теория (модель) объектных отношений предполагает, что то, как люди относятся к другим людям и ситуациям, в их взрослой жизни формируются семейным опытом в младенческом возрасте. К. Юнг 10.3 выдвинул так называемую модель самости и ввел в психологию понятие архетипа (первообраза) – начальной схемы разных образов, воспроизводящихся на бессознательном уровне. Архетипом человека является самость. Великие духовные учителя, такие, как Христос, Магомет и Будда, являются также и символами самости. Архетипы активизируют воображение человека, что отражается в разных мифах, во снах, в верованиях, в фантазиях индивидуума и даже в искусстве. К. Юнг утверждал, что архетипы человечество наследует, то есть они являются коллективным бессознательным. К ним относятся, например, Аниба (бессознательное начало противоположного пола), Мудрый старик, Великая Мать – высшее женское начало, Самость и др. [214]. В психологии сновидений - одном из самых таинственных явлений – рассматриваются несколько моделей. Согласно метафизической модели источником сновидения является не реальность (физическая или психическая), а находящийся за ее пределами некий «иной мир»: духовный, трансцендентный, потусторонний, загробный и пр. В авраамических религиях сновидения рассматривались как «каналы» для божественного откровения, но при этом не исключалась возможность использования состояния сна «злыми силами». Естественнонаучная модель опиралась только на нейрофизиологию и психофизиологию, полагая, что единственными источниками сновидческих образов и переживаний являются память, воображение и текущее восприятие человека. Так, И.М. Сеченов (1829 - 1905) писал: «Сновидение есть небывалая комбинация бывалых впечатлений». Однако говорил, что ему не был вполне понятен феномен открытий, сделанных во сне. Или, например, признание Ференца Листа, который во сне услышал «Мефисто-вальс», наигранный ему лично Дьяволом. Выдающийся современный психолог и философ А. Менегетти (1936 — 2013), исследуя взаимосвязь сновидений и здоровья человека, отметил, что в снах часто отражается реальное состояние внутренних органов, скрытые или только начинающиеся болезни. Согласно психологической модели (З. Фрейд, А. Адлер, 1870 – 1937, К. Юнг и другие) основным источником материала для сновидений являются нереализованные желания, «вытесненные инстинктивные импульсы», «коллективное бессознательное» и прочее. Причем А. Адлер считал, что сновидение — это и переживание будущих событий. К. Юнг предположил, что сны могут содержать мифологические, архетипические символы, связанные не только с личным опытом, но и с коллективным бессознательным всего человечества. Их значение универсально для всех культур и может иметь эзотерический смысл, быть духовным откровением для сновидца. Существует и несколько так называемых интегративных моделей сновидения, в которых предпринята попытка объединения рассмотренных выше. Так некоторые ученые предполагают, что во сне субъект получает доступ ко всему массиву памяти, актуализируются не любые ее элементы, а лишь те, которые могут быть ассоциированы с текущей ситуацией. Что мышления во сне во многом напоминают мышление архаического человека с его высокой аффективностью, нелогичностью, символичностью и наглядно-образным характером, а также полисемантичностью. Что сновидения дают символические подсказки из бессознательного для восстановления утраченной гармонии и пр. Есть гипотеза (модель) о тренировочном предназначении сновидений: во сне моделируются возможные угрозы, мы учимся избегать их, моделируем свои эмоциональные реакции на возможные в реальности ситуации и т.д. Память — функция умственной деятельности, предназначенная сохранять, накапливать и воспроизводить информацию. Наиболее критически настроенные ученые полагают, что «о памяти мы не знаем ничего. Она по-прежнему остается загадкой. Мы строим теоретические модели, наблюдая за тем, как работает память. Насколько они соответствуют реальности, трудно судить» [В. Поликарпов, 139]. Функциональные модели: произвольная или естественная (работу памяти мы не замечаем); искусственная или искусная (требующая некоторых усилий для запоминания); механическая (память способна только запоминать информацию, записывать и вовремя воспроизводить те или иные ее фрагменты). Модели памяти в когнитивной психологии основываются на проведении аналогии между преобразованием информации в компьютере и познавательными процессами у человека. Так многоэтажая информационная модель памяти Р. Аткинсона-Р. Шифрина (1968 г.) выделяла две структуры памяти: кратковременную и долгосрочную, и гибкие управляющие процессы. Позже они дополнили эту триаду ультракратковременной памятью, или сенсорными регистрами, где информация удерживается в течение совсем небольшого времени – 0.5 – 4 сек. - для поддержания непрерывности процесса восприятия. В 1974 году Алан Бэддели представляет модель рабочей памяти, которая включает в себя часть и кратковременной, и долговременной памяти человека. В компонентной модели память рассматривается как некоторая совокупность коробочек, а в альтернативных моделях (уровня перереботки Ф. Крейка и Р. Локхарта 1970-е гг., и другие) - как функция от глубины обработки информации. Модель двойственной памяти Д. Нормана и Н. Во выделяет две структуры памяти: первичную, хранящую временную информацию, которую человек использует в данный момент, и вторичную, сохраняющую информацию на длительное время. Модели долговременной памяти включают процедурные модели хранения умений и навыков, декларативные модели хранения фактов, в том числе, семантической памяти (знания о мире) и эпизодические (о нашей жизни). Структурная модель памяти представляет собой очень сложную конфигурацию взаимодействующих подсистем, которые обеспечивают выполнение всех основных функций памяти. Культурные, коллективные, социальные модели памяти основаны на таких понятиях, как миф, традиция, индивидуальная память и прочее, и прочее. Метафорические модели сравнивают память с чем-либо привычным. Во-первых, известны античные (Платон, Аристотель) и средневековые модели памяти как письмена на восковой дощечке с различной толщиной воска. Во-вторых, были популярны модели, рассматривающие память как вместилище, склад. Так, по модели св. Августина (354 — 430) [1] память похожа на огромные палаты с укромными закоулками и тайниками, где хранятся собранные и рассортированные впечатления и понятия, законы математики, представления о счастье и Боге, Который постоянно присутствует в нашей памяти, и мы просвещаемся о Нем через «внутреннего учителя». Философ Джулио Камилло (ок. 1480 – 1544) предложил план эзотерического театра– модели памяти, при соприкосновении с которым у человека активизировались скрытые механизмы и проявлялись те способности, которыми он ранее не обладал. Другие ученые, например, Джордано Бруно, пытались повторить или даже превзойти Джулио Камилло, но это им так и не удалось. В ХХ веке это уже механические, наложения фотографий, а затем и информационные (кибернетические) модели, о которых сказано выше. Авторы химических (биохимических) моделей памяти полагают, что в основе механизмов процессов закрепления, сохранения и воспроизведения следов лежат специфические химические изменения, происходящие в нервных клетках под действием внешних раздражителей. Физиологические и физические модели памяти (или нейронные модели) исходят из того, что прохождение любого нервного импульса через определенную группу нейронов оставляет после себя некоторый физический след. Поэтому рассматриваемую теорию называют еще теорией нейронных моделей. Например, в модели Д. Хебба кратковременная память основана на электрофизиологических механизмах, поддерживающих возбуждение связанных нейронных систем, а долговременная память фиксируется структурными изменениями в отдельных клетках, входящих в состав нейронных систем, и связана с химической трансформацией, образованием новых веществ. Среди психологических моделей памяти можно выделить два направления. Ассоциативные модели исходят из того, что если определенные психические образования возникли в сознании одновременно или непосредственно друг за другом, то между ними образуется ассоциативная связь и повторное появление какого-либо из элементов этой связи необходимо вызывает в сознании представление всех ее элементов. Гештальтные модели в качестве основы образования связей вызывают организацию материала, которая определяет и аналогичную структуру следов в мозгу по принципу изоморфизма, т.е. подобия по форме. В 2000 г. Эдвардом Кейси была опубликована феноменологическая модель памяти, в которой исходным является то, что любые объекты или факты действительности познаются и осознаются нами, только будучи каким-то образом запечатлены и проявлены в сознании, т.е. как феномены. Идеи К. Юнга нашли дальнейшее развитие в так называемой трансперсональной психологии, объектом которой является человек, ищущий пути самосовершенствования и самопознания. Трансперсональная психология строит теоретические модели, в которых на основе современной науки, эзотерики и религии объясняет и практически выявляет скрытые творческие возможности человека и способности его к прозрению [В. Налимов, 120, 121 и др.]. В частности, инсайт – модель озарения (когда вдруг кажется, что вы поняли, как решается задача). Модели психических болезней и расстройств разнообразны. Психосоциальная модель объясняет патологическое поведение настоящими или прошлыми социальными условиями, определяющими обучение данным патологическим формам поведения. В биопсихосоциальной модели болезнь рассматривается как такое расстройство, которое угрожает неспособностью психобиологических механизмов выполнять свои функции в определенном социокультурном пространстве. Среди поведенческих и аффективных моделей расстройств выделяют параноидные, шизоидные, антисоциальные, эмоционально-неустойчивые, истерические, нарциссические, пассивно-агрессивные, деменции, биполярного или маниакально-депрессивного расстройства – болезни гениев, и другие. Искусственный интеллект или модели знаний и творческого процесса — раздел информатики, изучающий трудно формализуемые задачи имитации человеческого мышления. В искусственном интеллекте рассматриваются некоторые разновидности агентного моделирования, появившиеся в новейшее время. Символьные модели имитируют мыслительные процессы. Фреймовые (рамочные или каркасные) модели – представления знаний в искусственном интеллекте или, другими словами, систематизированные психологические модели памяти человека и его сознания, схемы его действий в реальной ситуации, доступные искусственному интеллекту. Гибридные модели - синергетическая комбинация нейронных и символьных моделей. В частности, модель ассоциативного мышления используется в программах распознавания образов, обучающих программах и др. 10.5. Модели в геронтологии Общая причина старения и смерти с научной точки зрения – дискретность существования организмов, ведущая к априорной недостаточности внутренних механизмов самосохранения при заведомо неограниченном влиянии со стороны внешних воздействий окружающей среды. Без этого не была бы возможна эволюция. Специалисты говорят, что на сегодняшний день в науке о старении - геронтологии - более 300 теорий (моделей) старения. Это связано и тем, что она имеет дело с очень сложной системой и включает в себя биологию, физиологию, эпидемиологию, демографию, биохимию, биофизику, генетику, медицину и т.д. Вот некоторые из моделей, касающихся индивидуальных организмов (таблица 35). Модели, можно условно подразделить на две большие группы: 1) медицинские (биологические, биохимические, термодинамические и др.) и 2) математические.

Таблица 35. Модели в геронтологии

    35.1. Медицинские (биологические, биохимические, термодинамические и др.)
        35.1.1. Информационные
    35.1. Медицинские (биологические, биохимические, термодинамические и др.)
        35.1.2. Экологические
    35.1. Медицинские (биологические, биохимические, термодинамические и др.)
        35.1.3. Элевационные
    35.1. Медицинские (биологические, биохимические, термодинамические и др.)
        35.1.4. Регуляторные
    35.1. Медицинские (биологические, биохимические, термодинамические и др.)
        35.1.5. Иммунные
    35.1. Медицинские (биологические, биохимические, термодинамические и др.)
        35.1.6. Инво-люционные
            35.1.6.1. Свободно-радикальные
    35.1. Медицинские (биологические, биохимические, термодинамические и др.)
        35.1.6. Инво-люционные
            35.1.6.2. Другие
    35.1. Медицинские (биологические, биохимические, термодинамические и др.)
        35.1.7. Генетическая
    35.1. Медицинские (биологические, биохимические, термодинамические и др.)
        35.1.8. Гормональная
    35.1. Медицинские (биологические, биохимические, термодинамические и др.)
        35.1.9. Поперечных связей.
    35.1. Медицинские (биологические, биохимические, термодинамические и др.)
        35.1.10. Предела делений
    35.1. Медицинские (биологические, биохимические, термодинамические и др.)
        35.1.11. Темпа жизни
    35.1. Медицинские (биологические, биохимические, термодинамические и др.)
        35.1.12. Деградации теломеров
    35.2. Математические
        35.2.1. Ана-литические
            35.2.1.1. Гомперца
    35.2. Математические
        35.2.1. Ана-литические
            35.2.1.2. Стрелера-Милдвана
    35.2. Математические
        35.2.1. Ана-литические
            35.2.1.3. Сечера-Трукко
    35.2. Математические
        35.2.1. Ана-литические
            35.2.1.4. Брауна-Форбса
    35.2. Математические
        35.2.1. Ана-литические
            35.2.1.5. Лавинообразного разрушения
    35.2. Математические
        35.2.1. Ана-литические
            35.2.1.6. Резервированных систем
    35.2. Математические
        35.2.1. Ана-литические
            35.2.1.7. Цепочечная
    35.2. Математические
        35.2.1. Ана-литические
            35.2.1.8. Механистическая Плетчера
    35.2. Математические
        35.2.1. Ана-литические
            35.2.1.9. Стохастические
    35.2. Математические
        35.2.1. Ана-литические
            35.2.1.10. Другие
    35.2. Математические
        35.2.2. Системные (механисти-ческие)
            35.2.2.1. Баланса ресурсов
    35.2. Математические
        35.2.2. Системные (механисти-ческие)
            35.2.2.2. Партриджа-Бертона
    35.2. Математические
        35.2.2. Системные (механисти-ческие)
            35.2.2.3. Дасгупти-Штауфера
    35.2. Математические
        35.2.2. Системные (механисти-ческие)
            35.2.2.4. Хаотическая
    35.2. Математические
        35.2.2. Системные (механисти-ческие)
            35.2.2.5. Генетическая
    35.2. Математические
        35.2.2. Системные (механисти-ческие)
            35.2.2.6. Двухуровневая
    35.2. Математические
        35.2.2. Системные (механисти-ческие)
            35.2.2.7. Гомеостатическая Колтофера
    35.2. Математические
        35.2.2. Системные (механисти-ческие)
            35.2.2.8. Гомеостатическая Новосельцева
    35.2. Математические
        35.2.2. Системные (механисти-ческие)
            35.2.2.9. Междисциплинар-ная Новосельцева

Согласно медицинским моделям старения: смерть всегда является результатом развития болезни; если бы не было болезни, не было бы и смерти. К этой группе относятся ниже следующие. Модель старения в результате спонтанной потери и изменения информации вследствие случайного накопления ошибок в ходе самокопирования материальных носителей информации 10.4. Модель экологическая, утверждающая, что старение и связанные с ним заболевания есть результат воздействия неблагоприятных факторов внешней среды. Модель элевационная (онтогенетическая) утверждающая, что изменения гомеостаза, которые происходят в процессе развития и жизнедеятельности организма, приводят в итоге к развитию заболеваний и старению. Регуляторная модель учитывает то, что для осуществления долговременных процессов развития организм использует специальные уже чисто регуляторные, механизмы, функционирующие на уровне целостного организма. В ряде случаев осуществление таких регуляторных программ может приводить к снижению самообновления, а, значит, и жизнеспособности, к старению. Иммунная модель объясняет возрастное снижение клеточного роста и самообновления непосредственно с регуляторными изменениями в лимфоидной системе иммунитета. Модель инволюционная (метаболическая или аккумуляционная) исходит из того, что в организме с течением времени происходит накопление повреждений и продуктов метаболизма. Частным случаем этой модели является свободно-радикальная модель старения Д. Хартмана (1955 г.), которая объясняет старение организма накоплением повреждений клеток активными формами кислорода. Модель генетического контроля исходит из того, что в организме заложена программа (геном) на уничтожение. Модель гормона смерти предполагает, что смерти нервных клеток способствует вырабатываемый гипофизом "гормон смерти" DECO. Он уменьшает потребление кислорода, тормозит скорость преобразования пищи в энергию. Биохимическая модель поперечных связей Юхана Бьеркстена (1942 г.) объясняет такие проявления старости, как склероз, снижение иммунитета, потеря кожей эластичности следствием образования поперечных связей в белках. Модель предела делений Леонарда Хэйфлика (1961 г.) предполагает, что процесс старения управляется биологическими часами, которые находятся в каждой живой клетке. В течение жизни клетки делятся 50 раз, а затем наступает смерть. На скорость деления влияет питание: голодные клетки делятся в три раза медленнее чем "перекормленные". Соответственно, чем меньше мы едим, тем дольше живем. Модель темпа жизни рассматривает взаимосвязь между скоростью обмена веществ и долголетием. Предполагается, что любой организм рожден с ограниченным количеством энергии. Если используется эта энергию медленно, то живет организм дольше. Модель деградации теломеров исходит из того, что теломеры – последовательности нуклеиновых кислот, находящихся на концах хромосом, каждый раз, когда клетки делятся, укорачиваются, что приводит к повреждениям и смерти клеток. Математические модели старения обычно относят к двум типам: аналитические и системные или механистические. Модели аналитические (модели данных) не используют какие-либо гипотезы о физических процессах в системах, для которых эти данные получены. К ним относятся, в частности, и все модели математической статистики. Системные модели строятся преимущественно на базе физических законов и гипотез и в целом рассматривают много отдельных факторов, событий и явлений, которые непосредственно влияют на выживание организмов и рождения потомства. Модели Гомпертца 1825 года и Гомпертца-Мейкхама исходят из того, что для любого родившегося организма "жизненная сила" имеет тенденцию только растрачиваться со временем. При этом она снижается пропорционально ей самой в каждый момент времени. Эта модель положила начало к развитию математической демографии и математической геронтологии. Согласно модели Стрелера-Милдвана 1960 года, дополнившей предыдущую модель, увеличение продолжительности жизни людей должно приводить к «ректангуляризации» кривой дожития. То есть, в идеале все должны умирать в одинаковом возрасте, соответствующем видовой продолжительности жизни человека. Похожей моделью является модель Сечера-Трукко. Модель Брауна-Форбса 1974 года, модель «лавинообразного разрушениям» организма при старении Гавриловых 1991 года, модель «резервированных систем» Гавриловых 1991 года, «цепочечная» модель Пенны 1995 года, механистическая модель Плетчера-Нойхаузера 2000 года и другие – все это аналитические модели. К ним же относятся стохастические модели, основанные на теории надежности. К системным моделям среди других относят: модели баланса ресурсов Резника 1985 года и других, модель Партриджа-Бертона 1993 года, модель Дасгупти-Штауфера 1994 года, хаотическая модель генной регуляции Соловьева 1991 года, а также ниже следующие. Модель генетическая (внутриклеточная Орра 1999 года) программного старения исходит из предположения о запрограммированной гибели клеток. Двухуровневая модель Новосельцева 1990 года представляет организм как «естественную технологическую систему», в которой процесс старения воспроизводится за счет «внешней» причины — экспоненциального снижения регуляторных способностей физиологических систем. Смерть наступает при исчерпании ресурсов организма. Гомеостатические модели Колтофера 1997 года, В. Новосельцева и других 2000 года являются в известной степени развитием предыдущей. В них старение клеточных механизмов представляется, как постепенное снижение с возрастом их эффективности в результате накопления оксидативных повреждений. При этом скорость клеточного старения определяется, с одной стороны, темпом потребления кислорода в клетке, а с другой — эффективностью механизмов ее антиоксидантной защиты. Следствием клеточного старения является постепенное снижение с возрастом энергетического ресурса клеток. Это приводит к снижению гомеостатических способностей отдельных систем организма. В.Н. Новосельцевым (1935 – 2015) разработана междисциплинарная модель, которая включает нескольких разнородных моделей, каждая из которых написана в терминах своей дисциплины, и взаимодействующих между собой определенным образом с помощью математического языка. При этом, по его словам, изучение процессов старения на компьютерных моделях уже дало название новой дисциплине - «геронтология in silico» («в кремнии», т.е. в компьютере) 10.5 [В. Анисимов, 7]. 
